WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"
#include <WiFi.h>
#include <ctype.h>
#include <stdlib.h>
#include <string.h>
#include <vector>
#include <time.h>
#include <mbedtls/md.h>
#include <Preferences.h>

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = CONFIG_LED_MAX_INTENSITY;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

// camera metadata to expose to controller
static char device_name[32] = "cam3";
static char room_id[32]    = "unknown";
static char location[32]   = "unknown";
static char cam_mode [32]  = "room"; // room or door
static float poll_interval = 10.0f;
static char device_mac[18] = "";  // MAC address buffer

static Preferences prefs;
static bool normalize_cam_mode_value(const char *input, char *output, size_t output_len);
static bool cam_mode_requires_encryption();
static bool json_find_value(const char *json, const char *key, const char **value_start);
static bool json_get_string(const char *json, const char *key, char *out, size_t out_len);
static bool json_get_float(const char *json, const char *key, float *out);

static void load_props_from_nvs() {
  prefs.begin("cam_props", /*readOnly=*/true);
  prefs.getString("name", device_name, sizeof(device_name));
  prefs.getString("room_id", room_id, sizeof(room_id));
  prefs.getString("location", location, sizeof(location));
  prefs.getString("cam_mode", cam_mode, sizeof(cam_mode));
  poll_interval = prefs.getFloat("poll_interval", poll_interval);
  prefs.end();

  char normalized_mode[32];
  if (!normalize_cam_mode_value(cam_mode, normalized_mode, sizeof(normalized_mode))) {
    strlcpy(cam_mode, "room", sizeof(cam_mode));
  } else {
    strlcpy(cam_mode, normalized_mode, sizeof(cam_mode));
  }
}

static void save_props_to_nvs() {
  prefs.begin("cam_props", /*readOnly=*/false);
  prefs.putString("name", device_name);
  prefs.putString("room_id", room_id);
  prefs.putString("location", location);
  prefs.putString("cam_mode", cam_mode);
  prefs.putFloat("poll_interval", poll_interval);
  prefs.end();
}

static bool normalize_cam_mode_value(const char *input, char *output, size_t output_len) {
  if (!input || !output || output_len == 0) {
    return false;
  }

  if (strcmp(input, "room") == 0 || strcmp(input, "room_cam") == 0 || strcmp(input, "room-camera") == 0) {
    strlcpy(output, "room", output_len);
    return true;
  }

  if (strcmp(input, "unknown") == 0) {
    strlcpy(output, "room", output_len);
    return true;
  }

  if (strcmp(input, "door") == 0 || strcmp(input, "doorway") == 0 || strcmp(input, "door_cam") == 0 || strcmp(input, "door-camera") == 0) {
    strlcpy(output, "door", output_len);
    return true;
  }

  return false;
}

static bool cam_mode_requires_encryption() {
  return strcmp(cam_mode, "door") == 0;
}

static bool json_find_value(const char *json, const char *key, const char **value_start) {
  if (!json || !key || !value_start) {
    return false;
  }

  char pattern[48];
  int pattern_len = snprintf(pattern, sizeof(pattern), "\"%s\"", key);
  if (pattern_len <= 0 || (size_t)pattern_len >= sizeof(pattern)) {
    return false;
  }

  const char *cursor = strstr(json, pattern);
  if (!cursor) {
    return false;
  }

  cursor += pattern_len;
  while (*cursor && isspace((unsigned char)*cursor)) {
    ++cursor;
  }
  if (*cursor != ':') {
    return false;
  }
  ++cursor;
  while (*cursor && isspace((unsigned char)*cursor)) {
    ++cursor;
  }

  *value_start = cursor;
  return true;
}

static bool json_get_string(const char *json, const char *key, char *out, size_t out_len) {
  const char *value_start = NULL;
  if (!out || out_len == 0) {
    return false;
  }
  if (!json_find_value(json, key, &value_start) || *value_start != '"') {
    return false;
  }

  ++value_start;
  const char *value_end = strchr(value_start, '"');
  if (!value_end) {
    return false;
  }

  size_t value_len = (size_t)(value_end - value_start);
  if (value_len >= out_len) {
    value_len = out_len - 1;
  }
  memcpy(out, value_start, value_len);
  out[value_len] = '\0';
  return true;
}

static bool json_get_float(const char *json, const char *key, float *out) {
  const char *value_start = NULL;
  if (!out) {
    return false;
  }
  if (!json_find_value(json, key, &value_start)) {
    return false;
  }

  char *endptr = NULL;
  float value = strtof(value_start, &endptr);
  if (endptr == value_start) {
    return false;
  }
  *out = value;
  return true;
}

// Shared-secret auth (Phase 1)
// Configure these to match controller-side values.
// static const bool AUTH_ENABLED = true;
static const bool AUTH_ENABLED = false;  // Temporary: disable access restriction
static const char *AUTH_DEFAULT_CONTROLLER_ID = "gel-controller-1";
static const char *AUTH_DEFAULT_SHARED_SECRET = "niapcinimod";
static const long AUTH_MAX_SKEW_SECONDS = 45;
static const size_t AUTH_NONCE_CACHE_SIZE = 32;

// Pairing flow (Phase 2)
static const long PAIRING_WINDOW_SECONDS = 300;
static long pairing_open_until = 0;

static char auth_controller_id[48] = "gel-controller-1";
static char auth_shared_secret[96] = "niapcinimod";

