WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
typedef struct {
  char nonce[40];
  long seen_at;
} auth_nonce_entry_t;

static auth_nonce_entry_t auth_nonce_cache[AUTH_NONCE_CACHE_SIZE];
static size_t auth_nonce_cache_pos = 0;

static void clear_nonce_cache() {
  memset(auth_nonce_cache, 0, sizeof(auth_nonce_cache));
  auth_nonce_cache_pos = 0;
}

static bool is_pairing_open() {
  long now_ts = (long)time(NULL);
  return pairing_open_until > now_ts;
}

static void open_pairing_window() {
  long now_ts = (long)time(NULL);
  pairing_open_until = now_ts + PAIRING_WINDOW_SECONDS;
}

static void close_pairing_window() {
  pairing_open_until = 0;
}

static long pairing_seconds_left() {
  long now_ts = (long)time(NULL);
  long remaining = pairing_open_until - now_ts;
  return remaining > 0 ? remaining : 0;
}

static const char *method_to_string(int method) {
  switch (method) {
    case HTTP_GET: return "GET";
    case HTTP_POST: return "POST";
    case HTTP_PUT: return "PUT";
    case HTTP_DELETE: return "DELETE";
    case HTTP_HEAD: return "HEAD";
    case HTTP_PATCH: return "PATCH";
    default: return "OTHER";
  }
}

static bool get_header_value(httpd_req_t *req, const char *name, char *out, size_t out_len) {
  size_t hdr_len = httpd_req_get_hdr_value_len(req, name);
  if (hdr_len == 0 || hdr_len + 1 > out_len) {
    return false;
  }
  if (httpd_req_get_hdr_value_str(req, name, out, out_len) != ESP_OK) {
    return false;
  }
  return true;
}

static bool get_query_string(httpd_req_t *req, char *out, size_t out_len) {
  size_t query_len = httpd_req_get_url_query_len(req);
  if (query_len == 0) {
    out[0] = '\0';
    return true;
  }
  if (query_len + 1 > out_len) {
    return false;
  }
  return httpd_req_get_url_query_str(req, out, out_len) == ESP_OK;
}

static bool timing_safe_hex_equals(const char *a, const char *b) {
  size_t al = strlen(a);
  size_t bl = strlen(b);
  if (al != bl) {
    return false;
  }
  unsigned char diff = 0;
  for (size_t i = 0; i < al; ++i) {
    diff |= (unsigned char)(a[i] ^ b[i]);
  }
  return diff == 0;
}

static bool nonce_seen_recently(const char *nonce, long now_ts) {
  for (size_t i = 0; i < AUTH_NONCE_CACHE_SIZE; ++i) {
    if (auth_nonce_cache[i].nonce[0] == '\0') {
      continue;
    }
    if (strcmp(auth_nonce_cache[i].nonce, nonce) == 0) {
      if (labs(now_ts - auth_nonce_cache[i].seen_at) <= AUTH_MAX_SKEW_SECONDS) {
        return true;
      }
    }
  }
  return false;
}

static void remember_nonce(const char *nonce, long now_ts) {
  strlcpy(auth_nonce_cache[auth_nonce_cache_pos].nonce, nonce, sizeof(auth_nonce_cache[auth_nonce_cache_pos].nonce));
  auth_nonce_cache[auth_nonce_cache_pos].seen_at = now_ts;
  auth_nonce_cache_pos = (auth_nonce_cache_pos + 1) % AUTH_NONCE_CACHE_SIZE;
}

static bool hmac_sha256_hex(const char *secret, const char *message, char *out_hex, size_t out_hex_len) {
  if (out_hex_len < 65) {
    return false;
  }

  unsigned char digest[32];
  const mbedtls_md_info_t *md_info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (!md_info) {
    return false;
  }

  int rc = mbedtls_md_hmac(md_info,
                           (const unsigned char *)secret,
                           strlen(secret),
                           (const unsigned char *)message,
                           strlen(message),
                           digest);
  if (rc != 0) {
    return false;
  }

  for (size_t i = 0; i < sizeof(digest); ++i) {
    snprintf(out_hex + (i * 2), 3, "%02x", digest[i]);
  }
  out_hex[64] = '\0';
  return true;
}

static esp_err_t send_auth_error(httpd_req_t *req, const char *message, const char *code) {
  httpd_resp_set_status(req, code);
  httpd_resp_set_type(req, "application/json");
  return httpd_resp_sendstr(req, message);
}

static bool authorize_request(httpd_req_t *req) {
  (void)req;
  return true;  // Temporary: allow all requests without auth headers/signature

  if (!AUTH_ENABLED) {
    return true;
  }

  char controller_id[48];
  char timestamp_str[24];
  char nonce[40];
  char signature[96];
  char query[160];

  if (!get_header_value(req, "X-Controller-Id", controller_id, sizeof(controller_id))
      || !get_header_value(req, "X-Timestamp", timestamp_str, sizeof(timestamp_str))
      || !get_header_value(req, "X-Nonce", nonce, sizeof(nonce))
      || !get_header_value(req, "X-Signature", signature, sizeof(signature))) {
    send_auth_error(req, "{\"error\":\"missing auth headers\"}", "401 Unauthorized");
    return false;
  }

  if (strcmp(controller_id, auth_controller_id) != 0) {
    send_auth_error(req, "{\"error\":\"controller mismatch\"}", "403 Forbidden");
    return false;
  }

  char *endptr = NULL;
  long request_ts = strtol(timestamp_str, &endptr, 10);
  if (endptr == timestamp_str || *endptr != '\0') {
    send_auth_error(req, "{\"error\":\"invalid timestamp\"}", "401 Unauthorized");
    return false;
  }

  long now_ts = (long)time(NULL);
  if (now_ts <= 0 || labs(now_ts - request_ts) > AUTH_MAX_SKEW_SECONDS) {
    send_auth_error(req, "{\"error\":\"stale timestamp\"}", "408 Request Timeout");
    return false;
  }

  if (!get_query_string(req, query, sizeof(query))) {
    send_auth_error(req, "{\"error\":\"query too long\"}", "400 Bad Request");
    return false;
  }

  if (nonce_seen_recently(nonce, now_ts)) {
    send_auth_error(req, "{\"error\":\"nonce replay\"}", "409 Conflict");
    return false;
  }

  char signing_input[320];
  snprintf(
    signing_input,
    sizeof(signing_input),
    "%s\n%s\n%s\n%s\n%s",
    method_to_string(req->method),
    req->uri,
    query,
    timestamp_str,
    nonce
  );

  char expected_sig[65];
  if (!hmac_sha256_hex(auth_shared_secret, signing_input, expected_sig, sizeof(expected_sig))) {
    send_auth_error(req, "{\"error\":\"signature generation failed\"}", "500 Internal Server Error");
    return false;
  }

  if (!timing_safe_hex_equals(signature, expected_sig)) {
    send_auth_error(req, "{\"error\":\"invalid signature\"}", "401 Unauthorized");
    return false;
  }

  remember_nonce(nonce, now_ts);
  return true;
}

static esp_err_t pair_status_handler(httpd_req_t *req) {
  char resp[220];
  int len = snprintf(
    resp,
    sizeof(resp),
    "{\"device_id\":\"%s\",\"pairing_open\":%s,\"pairing_seconds_left\":%ld,\"controller_id\":\"%s\"}",
    device_mac,
    is_pairing_open() ? "true" : "false",
    pairing_seconds_left(),
    auth_controller_id
  );
  httpd_resp_set_type(req, "application/json");
  return httpd_resp_send(req, resp, len);
}

static esp_err_t pair_open_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }

