WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
  open_pairing_window();
  char resp[120];
  int len = snprintf(resp, sizeof(resp), "{\"ok\":true,\"pairing_seconds_left\":%ld}", pairing_seconds_left());
  httpd_resp_set_type(req, "application/json");
  return httpd_resp_send(req, resp, len);
}

static esp_err_t pair_claim_handler(httpd_req_t *req) {
  if (!is_pairing_open()) {
    return send_auth_error(req, "{\"error\":\"pairing is closed\"}", "403 Forbidden");
  }

  char buf[260];
  int rlen = httpd_req_recv(req, buf, min((int)sizeof(buf) - 1, (int)req->content_len));
  if (rlen <= 0) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Failed to read request");
  }
  buf[rlen] = 0;

  char controller_tmp[48];
  char secret_tmp[96];
  if (sscanf(buf, "{\"controller_id\":\"%47[^\"]\",\"shared_secret\":\"%95[^\"]\"}", controller_tmp, secret_tmp) != 2) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid payload");
  }

  if (strlen(controller_tmp) < 3 || strlen(secret_tmp) < 8) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Values too short");
  }

  strlcpy(auth_controller_id, controller_tmp, sizeof(auth_controller_id));
  strlcpy(auth_shared_secret, secret_tmp, sizeof(auth_shared_secret));
  clear_nonce_cache();
  close_pairing_window();

  httpd_resp_set_type(req, "application/json");
  return httpd_resp_sendstr(req, "{\"ok\":true,\"state\":\"paired_locked\"}");
}

static esp_err_t props_get_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  char resp[220];
  int len = snprintf(resp, sizeof(resp),
    "{\"name\":\"%s\",\"room_id\":\"%s\",\"location\":\"%s\",\"cam_mode\":\"%s\",\"poll_interval\":%.1f}",
    device_name, room_id, location, cam_mode, poll_interval);
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, resp, len);
}

// very light JSON parsing to keep deps out; swap for ArduinoJson if you prefer
static esp_err_t props_set_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  char buf[220];
  int rlen = httpd_req_recv(req, buf, min((int)sizeof(buf) - 1, (int)req->content_len));
  if (rlen <= 0) return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Failed to read request");
  buf[rlen] = 0;

  char name_tmp[32];
  char room_tmp[32];
  char location_tmp[32];
  char mode_tmp[32];
  char normalized_mode[32];
  float poll_tmp = poll_interval;

  if (!json_get_string(buf, "name", name_tmp, sizeof(name_tmp))
      || !json_get_string(buf, "room_id", room_tmp, sizeof(room_tmp))
      || !json_get_float(buf, "poll_interval", &poll_tmp)) {
    return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid props payload");
  }

  strlcpy(location_tmp, location, sizeof(location_tmp));
  if (json_get_string(buf, "location", location_tmp, sizeof(location_tmp))) {
    strlcpy(location, location_tmp, sizeof(location));
  }

  strlcpy(normalized_mode, cam_mode, sizeof(normalized_mode));
  if (json_get_string(buf, "cam_mode", mode_tmp, sizeof(mode_tmp))) {
    if (!normalize_cam_mode_value(mode_tmp, normalized_mode, sizeof(normalized_mode))) {
      return httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid cam_mode");
    }
  }

  strlcpy(device_name, name_tmp, sizeof(device_name));
  strlcpy(room_id, room_tmp, sizeof(room_id));
  strlcpy(cam_mode, normalized_mode, sizeof(cam_mode));
  poll_interval = poll_tmp;
  save_props_to_nvs();

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, "ok", 2);
}

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);
  esp_camera_fb_return(fb);
  if (!converted) {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();
#endif
  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
  return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

static esp_err_t send_jpeg_with_exif(httpd_req_t *req, const uint8_t *jpeg_buf, size_t jpeg_len, const char *description) {
  if (!jpeg_buf || jpeg_len < 2) {
    return ESP_FAIL;
  }

  // If not a valid JPEG SOI, send raw bytes as-is.
  if (!(jpeg_buf[0] == 0xFF && jpeg_buf[1] == 0xD8)) {
    return httpd_resp_send(req, (const char *)jpeg_buf, jpeg_len);
  }

