WeeDom/gel-controller/esp32cam/CameraWebServer/app_httpd.cpp
  const char *safe_desc = description ? description : "";
  size_t desc_len = strlen(safe_desc) + 1;  // include trailing NUL for ASCII EXIF value

  // EXIF APP1 payload:
  // Exif\0\0 + TIFF header + IFD0 (1 entry) + next IFD offset + description bytes
  const size_t exif_payload_len = 6 + 8 + 2 + 12 + 4 + desc_len;
  // APP1 length field includes itself.
  const size_t app1_len_field = exif_payload_len + 2;
  if (app1_len_field > 0xFFFF) {
    return ESP_FAIL;
  }
  if (cam_mode_requires_encryption()) {
    log_w("cam_mode=door requires encrypted capture output, but encryption is not implemented yet; sending plaintext JPEG");
  }
  std::vector<uint8_t> app1;
  app1.reserve(2 + 2 + exif_payload_len);

  // APP1 marker and length
  app1.push_back(0xFF);
  app1.push_back(0xE1);
  app1.push_back((uint8_t)((app1_len_field >> 8) & 0xFF));
  app1.push_back((uint8_t)(app1_len_field & 0xFF));

  // "Exif\0\0"
  app1.push_back('E');
  app1.push_back('x');
  app1.push_back('i');
  app1.push_back('f');
  app1.push_back(0x00);
  app1.push_back(0x00);

  // TIFF header (little-endian): "II", 42, IFD0 offset 8
  app1.push_back(0x49);
  app1.push_back(0x49);
  app1.push_back(0x2A);
  app1.push_back(0x00);
  app1.push_back(0x08);
  app1.push_back(0x00);
  app1.push_back(0x00);
  app1.push_back(0x00);

  // IFD0 entry count = 1
  app1.push_back(0x01);
  app1.push_back(0x00);

  // Tag: ImageDescription (0x010E), Type: ASCII (2)
  app1.push_back(0x0E);
  app1.push_back(0x01);
  app1.push_back(0x02);
  app1.push_back(0x00);

  uint32_t count = (uint32_t)desc_len;
  app1.push_back((uint8_t)(count & 0xFF));
  app1.push_back((uint8_t)((count >> 8) & 0xFF));
  app1.push_back((uint8_t)((count >> 16) & 0xFF));
  app1.push_back((uint8_t)((count >> 24) & 0xFF));

  // Offset to description string from start of TIFF header.
  uint32_t value_offset = 0x1A;  // 8 (TIFF) + 2 (count) + 12 (entry) + 4 (next IFD)
  app1.push_back((uint8_t)(value_offset & 0xFF));
  app1.push_back((uint8_t)((value_offset >> 8) & 0xFF));
  app1.push_back((uint8_t)((value_offset >> 16) & 0xFF));
  app1.push_back((uint8_t)((value_offset >> 24) & 0xFF));

  // Next IFD offset = 0
  app1.push_back(0x00);
  app1.push_back(0x00);
  app1.push_back(0x00);
  app1.push_back(0x00);

  // ImageDescription value bytes
  app1.insert(app1.end(), safe_desc, safe_desc + strlen(safe_desc));
  app1.push_back(0x00);

  esp_err_t res = ESP_OK;
  res = httpd_resp_send_chunk(req, (const char *)jpeg_buf, 2);  // SOI
  if (res != ESP_OK) return res;

  res = httpd_resp_send_chunk(req, (const char *)app1.data(), app1.size());
  if (res != ESP_OK) return res;

  res = httpd_resp_send_chunk(req, (const char *)(jpeg_buf + 2), jpeg_len - 2);
  if (res != ESP_OK) return res;

  return httpd_resp_send_chunk(req, NULL, 0);
}

static esp_err_t capture_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

#if defined(LED_GPIO_NUM)
  enable_led(true);
  vTaskDelay(150 / portTICK_PERIOD_MS);  // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
  fb = esp_camera_fb_get();              // or it won't be visible in the frame. A better way to do this is needed.
  enable_led(false);
#else
  fb = esp_camera_fb_get();
#endif

  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  char exif_description[200];
  snprintf(
    exif_description,
    sizeof(exif_description),
    "room_id=%s;location=%s;camera_name=%s;device_mac=%s;timestamp=%s",
    room_id,
    location,
    device_name,
    device_mac,
    ts
  );

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = send_jpeg_with_exif(req, fb->buf, fb->len, exif_description);
  } else {
    uint8_t *_jpg_buf = NULL;
    size_t _jpg_buf_len = 0;
    bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
    if (!jpeg_converted || !_jpg_buf) {
      res = ESP_FAIL;
    } else {
      res = send_jpeg_with_exif(req, _jpg_buf, _jpg_buf_len, exif_description);
    }
    if (_jpg_buf) {
      free(_jpg_buf);
    }
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = _jpg_buf_len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

static esp_err_t stream_handler(httpd_req_t *req) {
  if (!authorize_request(req)) {
    return ESP_FAIL;
  }
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame) {
    last_frame = esp_timer_get_time();
  }

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

#if defined(LED_GPIO_NUM)
  isStreaming = true;
  // Keep flash OFF during stream; only use it for still captures.
  enable_led(false);
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      log_e("Send frame failed");
      break;
    }
    int64_t fr_end = esp_timer_get_time();

    int64_t frame_time = fr_end - last_frame;
    last_frame = fr_end;

    frame_time /= 1000;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
#endif
    log_i(
      "MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)", (uint32_t)(_jpg_buf_len), (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time, avg_frame_time,
      1000.0 / avg_frame_time
    );
  }

#if defined(LED_GPIO_NUM)
  isStreaming = false;
  enable_led(false);
#endif

  return res;
}

